export const sfData = [
    {
        title: 'Факторы масштаба',
        selects: [
            {
                id: 0,
                title: 'Наличие опыта аналогичных разработок',
                options: [6.20, 4.96, 3.72, 2.48, 1.24, 0]
            },
            {
                id: 1,
                title: 'Гибкость процесса разработки',
                options: [5.07, 4.05, 3.04, 2.03, 1.01, 0.00]
            },
            {
                id: 2,
                title: 'Архитектура и разрешение рисков',
                options: [7.07, 5.65, 4.24, 2.83, 1.41, 0.00]
            },
            {
                id: 3,
                title: 'Сработанность команды',
                options: [5.48, 4.38, 3.29, 2.19, 1.10, 0.00]
            },
            {
                id: 4,
                title: 'Зрелость процессов',
                options: [7.80, 6.24, 4.68, 3.12, 1.56, 0.00]
            },
        ]
    },
]

export const emEarlyData = [
    {
        title: 'Параметры персонала',
        selects: [
            {
                id: 0,
                title: 'квалификация персонала',
                options: [2.12, 1.62, 1.26, 1.00, 0.83, 0.63, 0.50]
            },
            {
                id: 1,
                title: 'опыт персонала',
                options: [1.59, 1.33, 1.22, 1.00, 0.87, 0.74, 0.62]
            },
        ]
    },
    {
        title: 'Параметры продукта',
        selects: [
            {
                id: 2,
                title: 'сложность и надежность продукта',
                options: [0.49, 0.60, 0.83, 1.00, 1.33, 1.91, 2.72]
            },
            {
                id: 3,
                title: 'разработка для повторного использования',
                options: [NaN, NaN, 0.95, 1.00, 1.07, 1.15, 1.24]
            },
        ]
    },
    {
        title: 'Параметры платформы',
        selects: [
            {
                id: 4,
                title: 'сложность платформы разработки',
                options: [NaN, NaN, 0.87, 1.00, 1.29, 1.81, 2.61]
            },
        ]
    },
    {
        title: 'Параметры проекта',
        selects: [
            {
                id: 5,
                title: 'оборудование',
                options: [1.43, 1.30, 1.10, 1.00, 0.87, 0.73, 0.62]
            },
            {
                id: 6,
                title: 'требуемое выполнение графика работ',
                options: [NaN, 1.43, 1.14, 1.00, 1.000001, NaN, NaN]
            },
        ]
    },
]

export const emLateData = [
    {
        title: 'Параметры персонала',
        selects: [
            {
                id: 0,
                title: 'Возможности аналитика',
                options: [1.42, 1.29, 1.00, 0.85, 0.71, NaN]
            },
            {
                id: 1,
                title: 'Опыт разработки приложений',
                options: [1.22, 1.10, 1.00, 0.88, 0.81, NaN]
            },
            {
                id: 2,
                title: 'Возможности программиста',
                options: [1.34, 1.15, 1.00, 0.88, 0.76, NaN]
            },
            {
                id: 3,
                title: 'Продолжительность работы персонала',
                options: [1.29, 1.12, 1.00, 0.90, 0.81, NaN]
            },
            {
                id: 4,
                title: 'Опыт работы с платформой',
                options: [1.19, 1.09, 1.00, 0.91, 0.85, NaN]
            },
            {
                id: 5,
                title: 'опыт использования языка программирования',
                options: [1.20, 1.09, 1.00, 0.91, 0.84, NaN]
            },
        ]
    },
    {
        title: 'Параметры продукта',
        selects: [
            {
                id: 6,
                title: 'Требуемая надежность программы',
                options: [0.84, 0.92, 1.00, 1.10, 1.26, NaN]
            },
            {
                id: 7,
                title: 'Размер базы данных',
                options: [NaN, 0.23, 1.00, 1.14, 1.28, NaN]
            },
            {
                id: 8,
                title: 'Сложность программы',
                options: [NaN, 0.95, 1.00, 1.07, 1.15, 1.24]
            },
            {
                id: 9,
                title: 'Возможность многократного использования',
                options: [0.81, 0.91, 1.00, 1.11, 1.23, NaN]
            },
        ]
    },
    {
        title: 'Параметры платформы',
        selects: [
            {
                id: 10,
                title: 'Ограничения времени выполнения',
                options: [NaN, NaN, 1.00, 1.11, 1.29, 1.63]
            },
            {
                id: 11,
                title: 'Ограничения памяти',
                options: [NaN, NaN, 1.00, 1.05, 1.17, 1.46]
            },
            {
                id: 12,
                title: 'Изменяемость платформы',
                options: [NaN, 0.87, 1.00, 1.15, 1.30, NaN]
            },
        ]
    },
    {
        title: 'Параметры платформы',
        selects: [
            {
                id: 13,
                title: 'Использование инструментальных программ',
                options: [1.17, 1.09, 1.00, 0.90, 0.78, NaN]
            },
            {
                id: 14,
                title: 'Многоабонентская (удаленная) разработка',
                options: [1.22, 1.09, 1.00, 0.93, 0.86, 0.80]
            },
            {
                id: 15,
                title: 'Требуемое выполнение графика работ',
                options: [1.43, 1.14, 1.00, 1.000001, 1.000002, NaN]
            },
        ]
    },
]