export const data = [
    {
        title: 'Характеристики продукта',
        selects: [
            {
                id: 0,
                title: 'Требуемая надежность ПО',
                options: [0.75, 0.88, 1.00, 1.15, 1.40, NaN]
            },
            {
                id: 1,
                title: 'Размер БД приложения',
                options: [NaN, 0.94, 1.00, 1.08, 1.16, NaN]
            },
            {
                id: 2,
                title: 'Сложность продукта',
                options: [0.70, 0.85, 1.00, 1.15, 1.30, 1.65]
            },
        ]
    },
    {
        title: 'Характеристики аппаратного обеспечения',
        selects: [
            {
                id: 3,
                title: 'Ограничения быстродействия',
                options: [NaN, NaN, 1.00, 1.11, 1.30, 1.66]
            },
            {
                id: 4,
                title: 'Ограничения памяти',
                options: [NaN, NaN, 1.00, 1.06, 1.21, 1.56]
            },
            {
                id: 5,
                title: 'Неустойчивость окружения виртуальной машины',
                options: [NaN, 0.87, 1.00, 1.15, 1.30, NaN]
            },
            {
                id: 6,
                title: 'Требуемое время восстановления',
                options: [NaN, 0.87, 1.00, 1.07, 1.15, NaN]
            },
        ]
    },
    {
        title: 'Характеристики персонала',
        selects: [
            {
                id: 7,
                title: 'Аналитические способности',
                options: [1.46, 1.19, 1.00, 0.86, 0.74, NaN]
            },
            {
                id: 8,
                title: 'Опыт разработки',
                options: [1.29, 1.13, 1.00, 0.91, 0.82, NaN]
            },
            {
                id: 9,
                title: 'Способности к разработке ПО',
                options: [1.42, 1.17, 1.00, 0.86, 0.70, NaN]
            },
            {
                id: 10,
                title: 'Опыт использования виртуальных машин',
                options: [1.21, 1.10, 1.00, 0.90, NaN, NaN]
            },
            {
                id: 11,
                title: 'Опыт разработки на языках программирования',
                options: [1.14, 1.07, 1.00, 0.95, NaN, NaN]
            },
        ]
    },
    {
        title: 'Характеристики проекта',
        selects: [
            {
                id: 12,
                title: 'Применение методов разработки ПО',
                options: [1.24, 1.10, 1.00, 0.91, 0.82, NaN]
            },
            {
                id: 13,
                title: 'Использование инструментария разработки ПО',
                options: [1.24, 1.10, 1.00, 0.91, 0.83, NaN]
            },
            {
                id: 14,
                title: 'Требования соблюдения графика разработки',
                options: [1.23, 1.08, 1.00, 1.04, 1.10, NaN]
            },
        ]
    },
]